Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: གཞན་ཡང་ཆོས་གཅིག་སྟེ། འཇིག་རྟེན་གྱི་སྣ་ཚོགས་ལ་བཏང་སྙོམས་སུ་བྱེད་པའོ། །
en: There is another teaching: having equanimity about all the world’s variety.

source: གཞན་ཡང་ཆོས་གཅིག་སྟེ། དགེ་བའི་བཤེས་གཉེན་རྣམས་ལ་མི་སླུ་བའོ། །
en: There is another teaching: not deceiving spiritual friends.

source: གཞན་ཡང་ཆོས་གཅིག་སྟེ། རང་གི་སེམས་ཡོངས་སུ་དག་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཡོངས་སུ་དག་པར་ཤེས་པའོ། །
en: “There is another teaching: knowing the purity of the minds of all beings by purifying one’s own mind.

source: གཞན་ཡང་ཆོས་གཅིག་སྟེ། བཅོས་མ་མ་ཡིན་པས་བསམ་པ་དག་པའོ། །
en: There is another teaching: purifying one’s thoughts without contrivance.

source: གཞན་ཡང་ཆོས་གཅིག་སྟེ། ཁྱད་པར་དུ་འགྲོ་བས་ལྷག་པའི་བསམ་པ་དག་པའོ། །
en: There is another teaching: purifying one’s motivation with intention.

source: གཞན་ཡང་ཆོས་གཅིག་སྟེ། ལེགས་པར་བྱེད་པའི་ལས་བྱེད་པས་སྦྱོར་བ་དག་པའོ། །
en: There is another teaching: purifying one’s conduct with positive actions.

source: གཞན་ཡང་ཆོས་གཅིག་སྟེ། བསོད་ནམས་ཡོངས་སུ་དག་པས་མཚན་ཡོངས་སུ་དག་པའོ། །
en: There is another teaching: purifying the marks of perfection through purifying one’s merit.

source: གཞན་ཡང་ཆོས་གཅིག་སྟེ། ཤེས་པ་ཡོངས་སུ་དག་པས་ཉོན་མོངས་པ་ཡོངས་སུ་དག་པའོ། །
en: There is another teaching: purifying one’s afflictions through purifying one’s knowledge.

source: གཞན་ཡང་ཆོས་གཅིག་སྟེ། སེམས་ཅན་ཡོངས་སུ་དག་པས་ཞིང་ཡོངས་སུ་དག་པའོ། །
en: There is another teaching: purifying buddha realms by purifying beings.

source: གཞན་ཡང་ཆོས་གཅིག་སྟེ། མཚན་མ་མེད་པ་ལ་སོ་སོར་བརྟགས་ཏེ་ཡོངས་སུ་བསྔོ་བ་ལ་མཁས་པའོ། །
en: “There is another teaching: becoming skilled in dedication while analyzing signlessness.

source: གཞན་ཡང་ཆོས་གཅིག་སྟེ། རྗེས་སུ་འཐུན་པའི་ཆོས་ཀྱི་བཟོད་པའོ། །
en: There is another teaching: attaining the acceptance that concurs with reality.

source: གཞན་ཡང་ཆོས་གཅིག་སྟེ། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ཡོངས་སུ་བསྒོམས་ནས་ངེས་པར་གྱུར་པ་ལ་སོ་སོར་རྟོག་པའོ། །
en: There is another teaching: gaining certainty and understanding through cultivating the three gateways of liberation.

source: གཞན་ཡང་ཆོས་གཅིག་སྟེ། གནས་མེད་པ་ལ་གནས་པས་གནས་བརྟན་པའོ། །
en: There is another teaching: being an elder by living nowhere.

source: གཞན་ཡང་ཆོས་གཅིག་སྟེ། མངོན་པར་ཤེས་པས་རྣམ་པར་རྩེན་ཞིང་ཟག་པ་ཟད་པ་ཤེས་པ་ལ་འཇུག་པའོ། །
en: There is another teaching: enjoying super-knowledge and knowing the exhaustion of defilement.

source: གཞན་ཡང་ཆོས་གཅིག་སྟེ། ཞི་གནས་དང་ལྷག་མཐོང་གིས་ཡོངས་སུ་སྦྱང་བ་བྱས་པའི་རིགས་པ་དང་རྣམ་པར་གྲོལ་བའོ། །
en: There is another teaching: gaining understanding and liberation through having mastered tranquility and special insight.

source: གཞན་ཡང་ཆོས་གཅིག་སྟེ། ཐབས་ཀྱིས་ཡང་དག་པར་ཟིན་པའི་ཤེས་རབ་བསྒོམས་པའོ། །
en: There is another teaching: cultivating insight that is embraced by skillful means.

source: གཞན་ཡང་ཆོས་གཅིག་སྟེ། ཁམས་གསུམ་གྱི་སྙིང་པོ་ཐོབ་པ་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་རྒྱན་ནོ། །
en: There is another teaching: attaining the essence of the three realms as an ornament of the seat of awakening.

source: གཞན་ཡང་ཆོས་གཅིག་སྟེ། འདི་ལྟ་སྟེ་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་མངོན་པར་རྫོགས་པར་ཁོང་དུ་ཆུད་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་པའོ། །
en: There is another teaching: fully awakening to buddhahood by knowing the sameness of all phenomena.

source: འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་མ་སྐྱེས་པ་དང་མ་བྱུང་བར་རིག་ནས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་སྟེ།
en: It is attaining the acceptance that phenomena are unborn through realizing that all phenomena are unborn and non-arising by nature.

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ནི་ཐེག་པ་ཆེན་པོ་སྡུད་པར་འགྱུར་བའི་ཆོས་གཅིག་གོ །
en: Sāgaramati, that is a teaching that summarizes the Great Vehicle.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་དེ་དག་ནི་ཐེག་པ་ཆེན་པོ་སྡུད་པར་འགྱུར་བ་དང་། འཛིན་པ་དང་གནས་པ་ཐམས་ཅད་འདོད་པར་འགྱུར་བ་དག་གོ །
en: “Sāgaramati, these teachings summarize, uphold, and maintain the Great Vehicle.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་ཐེག་པ་ཆེན་པོ་ལ་གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ།
en: “Sāgaramati, there are two teachings that are held in high regard in the Great Vehicle.

source: གཉིས་གང་ཞེ།
en: What are they?

source: འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་མོས་པ་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་འདོད་པ་མེད་པ་སྟེ།
en: They are aspiring to the qualities of buddhahood and not desiring the qualities of the hearers or solitary buddhas.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་གཉིས་པོ་དེ་དག་ནི་ཐེག་པ་ཆེན་པོ་ལ་གཅེས་སྤྲས་བྱེད་པའོ། །
en: Sāgaramati, these two teachings are held in high regard in the Great Vehicle.

source: བློ་གྲོས་རྒྱ་མཚོ་ཐེག་པ་ཆེན་པོ་ལ་དགའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ།
en: “Sāgaramati, there are two teachings that are challenging in the Great Vehicle.

source: གཉིས་གང་ཞེ་ན།
en: What are they?

source: མོས་པས་རྣམ་པར་གྲོལ་བ་དེ་ཀུན་ཏུ་སྲུང་བ་དང་། རྣམ་པར་གྲོལ་བ་དེའི་ཕྱིར་ཆོས་སྟོན་པ་སྟེ།
en: They are protecting one’s liberation through aspiration, and teaching the Dharma for the sake of liberation.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་གཉིས་པོ་དེ་དག་ནི་ཐེག་པ་ཆེན་པོ་ལ་དགའ་བ་བྱེད་པའོ། །
en: Sāgaramati, these two teachings are challenging in the Great Vehicle.

source: བློ་གྲོས་རྒྱ་མཚོ་ཐེག་པ་ཆེན་པོ་ལ་གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ།
en: “Sāgaramati, there are two teachings that are held in high regard in the Great Vehicle.

source: བྱང་ཆུབ་ཀྱི་སེམས་ལས་མི་ཉམས་པ་དང་། སེམས་ལ་ལྟ་བ་ལ་བརྟན་པའོ། །
en: They are not straying from the mind of awakening and being stable in observing one’s mind.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བྱང་ཆུབ་ཀྱི་སེམས་ལ་སྒྱུ་མ་ལྟ་བུར་སོ་སོར་རྟོག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བདག་མེད་པར་སོ་སོར་རྟོག་པའོ། །
en: There are two teachings that are challenging: realizing the mind of awakening to be illusory and realizing all beings to be selfless.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བསམ་པ་མི་འདོར་བ་དང་། སྦྱོར་བ་བཅོས་མ་མ་ཡིན་པའོ། །
en: “There are two teachings that are held in high regard: not giving up one’s motivation and not contriving one’s conduct.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། རྩ་བ་ཡོངས་སུ་དག་པའི་བསམ་པ་དང་། བྱེད་པ་མེད་ཅིང་བྱེད་པ་དང་བྲལ་བ་ཡང་མ་ཡིན་པར་བསོད་ནམས་སོགས་པའོ། །
en: There are two teachings that are challenging: having thoughts with pure roots, and gathering merit while being neither active, nor inactive.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། དགེ་བའི་རྩ་བ་རྣམས་ལ་སྦྱོར་བ་དང་། སྦྱོར་བ་ཡང་ཉམས་འོག་ཏུ་ཆུད་པར་བྱེད་པའོ། །
en: “There are two teachings that are held in high regard: applying oneself to roots of virtue and immersing oneself in this endeavor.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སྤྲོས་པ་མེད་པར་སྦྱོར་བ་དང་། སྦྱོར་བ་ཉམས་འོག་ཏུ་ཆུད་པར་བྱེད་པས་དབེན་པའོ། །
en: There are two teachings that are challenging: practicing without conceptual elaborations and disengaging by bringing one’s practice into experience.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ལྷག་པའི་བསམ་པས་ཁྱད་པར་དུ་འགྲོ་བ་དང་། ཁྱད་པར་གྱིས་ཁྱད་པར་དུ་ལྷག་པར་དམིགས་པའོ། །
en: “There are two teachings that are held in high regard: excelling in pure motivation and observing what is uniquely special.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བདག་ཉིད་ཉེས་པ་མི་བྱེད་པ་དང་། གཞན་ཡང་ཉེས་པ་ལས་འབྱིན་པའོ། །
en: There are two teachings that are challenging: not engaging in negativities oneself and delivering others from negativities.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་དང་། རྣམ་པར་སྨིན་པ་ལ་མི་རེ་བའོ། །
en: “There are two teachings that are held in high regard: giving away all one’s possessions and not hoping for karmic ripening.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། མཉམ་པའི་སེམས་གཏོང་བ་དང་། ཡོངས་སུ་བསྔོ་བ་ལ་མཁས་པའོ། །
en: There are two teachings that are challenging: giving with an even mind and being skilled in dedication.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བསླབ་པ་མ་ཉམས་པ་དང་། སྐྱེ་བར་སྨོན་པ་མེད་པའོ། །
en: “There are two teachings that are held in high regard: not letting one’s trainings decline and not hoping for rebirth.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཚུལ་ཁྲིམས་འཆལ་པ་རྣམས་ལ་ཆེར་སྙིང་རྗེ་བ་དང་། བདག་ལ་མི་སྟོད་པའོ། །
en: There are two teachings that are challenging: being especially compassionate to those whose discipline is corrupt and not praising oneself.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བཟོད་ཅིང་དེས་པ་དང་། བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བའོ། །
en: “There are two teachings that are held in high regard: being patient and gentle, and dedicating merit toward awakening.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། རྗེས་སུ་ཆགས་པ་འདོར་བ་དང་། རྗེ་བོ་ལ་བཟོད་པ་བསྒོམ་པའོ། །
en: There are two teachings that are challenging: giving up attachment and cultivating patience for rulers.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་བཙལ་བར་རྩོམ་པའི་བརྩོན་འགྲུས་དང་། དགེ་བའི་རྩ་བ་ལ་ཡི་རང་བའོ། །
en: “There are two teachings that are held in high regard: having diligence that pursues all forms of virtue, and delighting in virtue.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ལུས་དང་སེམས་དབེན་པ་དང་། སེམས་གནས་པ་ཡོངས་སུ་ཐར་བར་བྱེད་པའོ། །
en: There are two teachings that are challenging: keeping body and mind in solitude, and freeing the fixated mind.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བསམ་གཏན་གྱི་ཡན་ལག་ཡང་དག་པར་སྡུད་པ་དང་། སེམས་ལས་སུ་རུང་བའོ། །
en: “There are two teachings that are held in high regard: gathering the requisites for concentration and gaining pliancy of mind.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བསམ་གཏན་ལས་ལྡོག་པ་ཤེས་པ་དང་། འདོད་པའི་ཁམས་ལ་སྨོད་པའོ། །
en: There are two teachings that are challenging: knowing how to undo concentration and disparaging the desire realm.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཆོས་དོན་དུ་གཉེར་བ་དང་ཆོས་འདོད་པའོ། །
en: “There are two teachings that are held in high regard: being passionate and eager for the Dharma.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཆོས་ལ་སོ་སོར་རྟོག་པ་དང་། ཆོས་ངེས་པར་སེམས་པའོ། །
en: There are two teachings that are challenging: contemplating and gaining certainty in Dharma.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། དགེ་བའི་བཤེས་གཉེན་ལ་བརྟེན་པ་དང་། བླ་མ་ལ་གུས་པར་བརྟེན་པའོ། །
en: “There are two teachings that are held in high regard: relying on a spiritual friend and respectfully relying on a spiritual master.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། གུས་པ་དང་བཀའ་བློ་བདེ་བའོ། །
en: There are two teachings that are challenging: being respectful and accepting advice.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། དུས་དང་དུས་མ་ཡིན་པར་ཡོངས་སུ་འདྲི་བ་དང་། དོན་མྱོང་བར་བྱེད་པའོ། །
en: “There are two teachings that are held in high regard: examining what is timely and untimely, and bringing the meaning into experience.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། དོན་ཤེས་པ་དང་། ཆོས་ཤེས་པའོ། །
en: There are two teachings that are challenging: understanding the meaning and being content.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཐོས་པའི་ནོར་གྱིས་མི་ངོམས་པ་དང་། ཐོས་པའི་ཤེས་རབ་ཀྱིས་ངོམས་མི་མྱོང་བའོ། །
en: “There are two teachings that are held in high regard: not being satisfied with the wealth of hearing and not being satisfied with the insight of hearing.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཚུལ་བཞིན་དུ་ཆོས་ལ་སོ་སོར་རྟོག་པ་དང་། ཚུལ་བཞིན་མ་ཡིན་པའི་ཆོས་རྣམ་པར་སྤོང་བའོ། །
en: There are two teachings that are challenging: accurately analyzing the Dharma and abandoning inaccurate teachings.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཆོས་སྟོན་པ་དང་། ཆོས་ཉན་པ་རྣམས་ལ་སྙིང་རྗེ་བའོ། །
en: “There are two teachings that are held in high regard: teaching Dharma and being compassionate to those who are listening to it.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སློབ་དཔོན་དཔེ་མཁྱུད་མེད་པ་དང་། ཟང་ཟིང་མེད་པའི་སེམས་ཀྱིས་ཆོས་སྟོན་པའོ། །
en: There are two teachings that are challenging: being a generous spiritual teacher and teaching the Dharma without any material aims.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། རྣ་བ་བླགས་ཏེ་ཉན་པ་དང་། ཐམས་ཅད་དུ་སེམས་ཀྱིས་སེམས་པའོ། །
en: “There are two teachings that are held in high regard: listening carefully and being highly motivated.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སྒྲིབ་པ་སེལ་བ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་སྒོམ་པའོ། །
en: There are two teachings that are challenging: eliminating obscurations and cultivating the branches of awakening.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། མཆོག་ཏུ་དགའ་བ་ཐོབ་པ་དང་། དགའ་བ་མྱོང་བའོ། །
en: “There are two teachings that are held in high regard: achieving supreme joy and experiencing joy.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། རུང་བ་རྣམས་ལ་ཚོད་ཤེས་པ་དང་། བདག་ཤེས་པ་ལ་འཇུག་པའོ། །
en: There are two teachings that are challenging: knowing the extent of what is permissible and obtaining self-knowledge.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་ཡིད་ཆེས་པ་དང་། ལེགས་པར་བྱ་བའི་ལས་བྱེད་པའོ། །
en: “There are two teachings that are held in high regard: trusting the ripening of karma and engaging in positive actions.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ལས་མེད་ཅིང་རྣམ་པར་སྨིན་པ་མེད་པར་མོས་པ་དང་། དགེ་བའི་ཆོས་ཀྱང་སྟོན་པའོ། །
en: There are two teachings that are challenging: longing for no karma and no karmic ripening, and teaching virtuous teachings.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཚིག་བདེན་པ་དང་། འཕགས་པའི་སྐྱེ་བོ་ལ་མི་སླུ་བའོ། །
en: “There are two teachings that are held in high regard: speaking truthfully and not deceiving noble beings.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཚུལ་མི་འཁྲུགས་པར་བྱེད་པའོ། །
en: There are two teachings that are challenging: practicing exactly what one preaches and not disrupting the buddha way.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ལུས་ཡོངས་སུ་དག་པ་དང་། མི་དགེ་བ་རྣམ་གསུམ་ཡོངས་སུ་སྤོང་བའོ། །
en: “There are two teachings that are held in high regard: purifying the body and abandoning the three nonvirtues.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ལུས་གཟུགས་བརྙན་ལྟ་བུ་དང་། རྩྭ་དང་རྩིག་པ་དང་ཤིང་ལྟ་བུར་སོ་སོར་རྟོག་པའོ། །
en: There are two teachings that are challenging: understanding that the body is like a reflection, and understanding that it is like grass, a wall, or wood.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ངག་ཡོངས་སུ་དག་པ་དང་། ངག་གི་སྐྱོན་བཞི་ཡོངས་སུ་སྤོང་བའོ། །
en: “There are two teachings that are held in high regard: purifying the speech and abandoning the four faults of speech.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཆོས་བརྗོད་དུ་མེད་པར་ཁོང་དུ་ཆུད་པ་དང་། སྒྲ་ཐམས་ཅད་བྲག་ཅ་དང་མཚུངས་པར་ཤེས་པའོ། །
en: There are two teachings that are challenging: mastering the inexpressible Dharma and understanding all sound to be like echoes.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སེམས་ཡོངས་སུ་དག་པ་དང་། བརྣབ་སེམས་དང་གནོད་སེམས་དང་ལོག་པར་ལྟ་བ་ཡོངས་སུ་སྤོང་བའོ། །
en: “There are two teachings that are held in high regard: purifying the mind, and abandoning covetousness, malice, and wrong views.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ནང་ཉེ་བར་ཞི་བ་དང་། ཕྱི་རོལ་ཏུ་མི་རྒྱུ་བའོ། །
en: There are two teachings that are challenging: being internally peaceful and externally still.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བྱམས་པ་སྒོམ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པ་ཉིད་དོ། །
en: “There are two teachings that are held in high regard: cultivating love and having an equal attitude toward all beings.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ནམ་མཁའ་ལྟར་རྣམ་པར་དག་ཅིང་དྲི་མ་མེད་པའི་བྱམས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་ཕྱིར་ཡོངས་སུ་སྔོ་བའོ། །
en: There are two teachings that are challenging: gaining love that is immaculate and pure like space and making dedications that protect all beings.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སྙིང་རྗེ་ཆེན་པོ་མི་འདོར་བ་དང་། དགེ་བའི་རྩ་བ་ཡོངས་སུ་ཚོལ་བ་ལ་ཡོངས་སུ་མི་སྐྱོ་བའོ། །
en: “There are two teachings that are held in high regard: not losing great compassion and never being discouraged in the pursuit of roots of virtue.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སྐྱེ་བ་མེད་པར་སོ་སོར་རྟོག་པ་དང་། ངེས་པར་གྱུར་པ་ཀུན་ཏུ་བསྲུང་བའོ། །
en: There are two teachings that are challenging: understanding the unborn and sustaining one’s certainty.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཆོས་ལ་དགའ་བས་དགའ་ཞིང་མོས་པ་དང་། མི་དགའ་བ་སྤོང་བའོ། །
en: “There are two teachings that are held in high regard: being inspired and eager because of one’s delight with the Dharma, and abandoning being uninspired.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། མི་སྨྲ་བའི་བརྟུལ་ཞུགས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། བརྟུལ་ཞུགས་མ་ཡིན་པ་མི་སྤྱོད་པའོ། །
en: There are two teachings that are challenging: perfecting the ascetic discipline of silence and only engaging in ascetic disciplines.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། རྗེས་སུ་ཆགས་པ་འདོར་བ་དང་། ཁོང་ཁྲོ་བ་སྤོང་བའོ། །
en: “There are two teachings that are held in high regard: letting go of attachments and abandoning anger.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བཏང་སྙོམས་སྒོམ་པ་དང་། སེམས་ཅན་ལ་ལྟ་བ་ཡོངས་སུ་སྤངས་པའོ། །
en: There are two teachings that are challenging: cultivating equanimity and abandoning views regarding beings.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་སྒོམ་པ་དང་། དྲན་པ་དེ་ལ་གནས་པར་སེམས་བསྐྱེད་པའོ། །
en: “There are two teachings that are held in high regard: cultivating the recollection of the Buddha and developing the mind of awakening and sustaining that recollection.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཆོས་ཀྱི་སྐུ་སྒོམ་པ་དང་། མཚན་གྱི་སྐུ་ཡང་སྒྲུབ་པའོ། །
en: There are two teachings that are challenging: cultivating the Dharma body and manifesting the body of marks.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཆོས་རྗེས་སུ་དྲན་པ་སྒོམ་པ་དང་། སེམས་ཅན་རྣམས་ཀྱང་ཆོས་ལ་སྦྱོར་བའོ། །
en: “There are two teachings that are held in high regard: cultivating the recollection of the Dharma and bringing beings to the Dharma.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། འདོད་ཆགས་དང་བྲལ་བའི་ཆོས་ཉིད་ལ་སོ་སོར་རྟོག་པ་དང་། འདོད་ཆགས་ལ་སྤྱོད་པའི་སེམས་ཅན་རྣམས་ལ་ཆེར་སྙིང་རྗེ་བའོ། །
en: There are two teachings that are challenging: realizing reality free of desire and generating extra compassion for beings who indulge in desire.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་རྗེས་སུ་དྲན་པ་དང་། ཕྱིར་མི་ལྡོག་པའི་དགེ་འདུན་ལ་ཡང་སྟོན་པའོ། །
en: “There are two teachings that are held in high regard: recollecting the bodhisattva saṅgha and teaching to the saṅgha of those who have reached the irreversible level.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། འདུས་མ་བྱས་ལ་ཡང་རྟོག་པ་དང་། འབྲས་བུ་ཐོབ་པ་ཡང་ཀུན་ཏུ་སྲུང་བའོ། །
en: There are two teachings that are challenging: realizing the unconditioned and maintaining one’s attainment of the result.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་མི་བརྗེད་པའོ། །
en: “There are two teachings that are held in high regard: recollecting discipline and not forgetting the mind of awakening.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། མངོན་པར་འདུ་བྱེད་པ་མེད་པའི་ཚུལ་ཁྲིམས་ལ་སོ་སོར་རྟོག་པ་དང་། ཚུལ་ཁྲིམས་འཆལ་པའི་སེམས་ཅན་སྡུད་ཅིང་ཡོངས་སུ་སྨིན་པར་བྱེད་པའོ། །
en: There are two teachings that are challenging: realizing unconditioned discipline, and attracting and ripening those beings with corrupt discipline.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། གཏོང་བ་རྗེས་སུ་དྲན་པ་དང་། འགྱོད་པ་མེད་པར་གཏོང་བའོ། །
en: “There are two teachings that are held in high regard: recollecting giving, and giving without regret.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། རང་གི་ཉོན་མོངས་པ་འདོར་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་སྤོང་བ་སྟོན་པའོ། །
en: There are two teachings that are challenging: giving up one’s own afflictions and teaching beings to discard their afflictions.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ལྷ་རྗེས་སུ་དྲན་པ་དང་། སྐྱེ་བར་སྨོན་པ་མེད་པའོ། །
en: “There are two teachings that are held in high regard: recollecting divinity and not aspiring to be reborn.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། དྲན་པ་དང་ཤེས་བཞིན་དང་། སེམས་གཡེང་བ་རྣམས་དྲན་པ་ལ་འགོད་པའོ། །
en: There are two teachings that are challenging: being mindful and aware, and establishing all who are distracted in mindfulness.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བསོད་ནམས་ཀྱི་ཚོགས་དང་། ཡེ་ཤེས་རྣམས་ཀྱི་ཚོགས་སོ། །
en: “There are two teachings that are held in high regard: gathering the accumulation of merit and the accumulation of wisdom.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། མངོན་པར་འདུ་བྱེད་པ་མེད་པའི་ཡེ་ཤེས་དང་། བསོད་ནམས་ཀྱི་ཚོགས་མ་སྨད་པའོ། །
en: There are two teachings that are challenging: obtaining unconditioned wisdom and not disparaging the accumulation of merit.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཆགས་པ་ལས་ཤིན་ཏུ་འདའ་བ་དང་། ཆགས་པས་ཞེན་པ་ཡོངས་སུ་འགྲེལ་པའོ། །
en: “There are two teachings that are held in high regard: transcending desire and explaining what it is to cling because of desire.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། འདུན་པ་དྲག་པ་དང་། སྒྱུ་མེད་ཅིང་གཡོ་མེད་པའོ། །
en: There are two teachings that are challenging: having strong resolve and being without pretense or deceit.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བྱས་པ་གཟོ་བ་དང་། བྱས་པ་ཤེས་པའོ། །
en: “There are two teachings that are held in high regard: showing gratitude and being grateful.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། འདུན་པའི་འདོད་ཆགས་སྤོང་བ་དང་། དགེ་བའི་ཆོས་ལ་འདུན་པ་མི་འདོར་བའོ། །
en: There are two teachings that are challenging: eliminating passionate attachment and not giving up one’s passion for virtuous qualities.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སྡིག་པ་ཐམས་ཅད་འཆགས་པ་དང་། སྡིག་པ་ཐམས་ཅད་མི་བྱེད་པའོ། །
en: “There are two teachings that are held in high regard: confessing all one’s misdeeds and not engaging in any misdeeds.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། འགྱོད་པ་མེད་པ་དང་། ཀུན་ནས་ལྡང་བ་མེད་པའོ། །
en: There are two teachings that are challenging: having no regret or complacency.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། གཞན་གྱི་བསོད་ནམས་ལ་རྗེས་སུ་ཡི་རང་བ་དང་། རང་གི་བསོད་ནམས་ཀྱིས་མི་ངོམས་པའོ། །
en: “There are two teachings that are held in high regard: rejoicing in others’ merit and not being satisfied with one’s own merit.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སྡིག་པ་ཐམས་ཅད་ཟད་པ་ཤེས་པ་དང་། བསོད་ནམས་བསགས་པ་ཤེས་པའོ། །
en: There are two teachings that are challenging: understanding the exhaustion of misdeeds and understanding the accumulation of merit.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སངས་རྒྱས་ཐམས་ཅད་ལ་གསོལ་བ་འདེབས་པ་དང་། ཆོས་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པའོ། །
en: “There are two teachings that are held in high regard: supplicating all the buddhas and upholding all of the Dharma.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཆོས་ཀྱི་དབྱིངས་འདྲེས་པ་མེད་པ་དང་། ཚིག་རབ་ཏུ་དབྱེ་བ་ཐམས་ཅད་བསྟན་པ་ཤེས་པའོ། །
en: There are two teachings that are challenging: knowing the unadulterated realm of phenomena and understanding how to teach all linguistic categories.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཡོངས་སུ་བསྔོ་བ་ལ་མཁས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་ཡོངས་སུ་བསྔོ་བའོ། །
en: “There are two teachings that are held in high regard: skill in dedication and dedicating to all beings equally.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། མཚན་མ་མེད་པ་འདྲེས་པར་བྱེད་པ་དང་། མཚན་མ་ཐམས་ཅད་རྣམ་པར་འཇིག་པའོ། །
en: There are two teachings that are challenging: becoming familiar with signlessness and destroying all signs.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སྟོང་པ་ཉིད་ལ་རྟོག་པ་དང་། སེམས་ཅན་ལ་ཡང་ལྟ་བའོ། །
en: “There are two teachings that are held in high regard: understanding emptiness and observing beings.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཤེས་རབ་ཀྱིས་ལྟ་བ་མེད་པ་དང་། ཐབས་ཀྱིས་ལྟ་བ་དང་བཅས་པའོ། །
en: There are two teachings that are challenging: eliminating views with insight and skillfully utilizing views.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། དགེ་བའི་རྩ་བ་འདོད་པ་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལ་སེམས་ཅན་ཐམས་ཅད་སྦྱོར་བའོ། །
en: “There are two teachings that are held in high regard: yearning for roots of virtue and bringing all beings to all forms of roots of virtue.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སྨོན་པ་མེད་པ་སྒོམ་པ་དང་། བསམས་བཞིན་དུ་སྐྱེ་བ་ཤེས་པའོ། །
en: There are two teachings that are challenging: cultivating wishlessness and knowing how to take rebirth intentionally.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། དེ་ལ་མ་ཆགས་པ་དང་། མི་གཡོ་བའོ། །
en: “There are two teachings that are held in high regard: not being attached or moved.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ང་རྒྱལ་མེད་པ་དང་། དེས་པའོ། །
en: There are two teachings that are challenging: being without pride and being gentle.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། དགོན་པ་ལ་གནས་པ་དང་། དགོན་པའི་ཡོན་ཏན་མྱོང་བའོ། །
en: “There are two teachings that are held in high regard: staying in solitude and experiencing the positive qualities of solitude.
